/* Optimized with RexxOpt 1.4 */
PARSE ARG Node;OPTIONS RESULTS;ADDRESS VALUE 'AERexxControl'Node;nwd=exists('doors:tzz/wally96/wally96.data');if nwd=0 then do;open(data,'doors:tzz/wally96/wally96.data',W);x=0;do until x=10;WRITELN(DATA," [33m                  <--<  NEW WALL  >--->                  [34m|[33m      [->tZZ<-][34m");x=x+1;end;close(data);open(data,'doors:tzz/wally96/wally96.sys',W);x=0;do until x=10;WRITELN(DATA,' [33m                  <--<  NEW WALL  >--->                  [34m|[33m      [->tZZ<-][34m');x=x+1;end;close(data);end;txt=transmit;sm=sendmessage;gc=getchar;ge=getuser;pr=putuser;pt=putustr;txt "";txt CENTER('[0m[1m[0m[1mc0DE[36m [[35m THE fUGITIVE[36m ][0m[1m dESIGN [36m[[35m RED.R[36m ] [[0m[1m tHE nUZZELS 96 [36m][0m',151);txt "[34mo[1m---------------------------------------------------------------------[0m[35m[3mkING![0m[34mo";ge "100";NAME=RESULT;ge "105";AXX=RESULT;RHAND=NAME;HAND=NAME;RES='[0m';RED='[31m';GRN='[32m';YEL='[33m';BLU='[34m';MAG='[35m';CYN='[36m';open(data,'doors:tzz/wally96/wally96.data',R);if axx>"240" then do;close(data);open(data,'doors:tzz/wally96/wally96.sys',R);end;READ:;A=readln(data);txt "."A":";txt ":                                                          +-- -  -        ·";B=readln(data);SM ".";SM B;TXT "·";txt "|                                                          +- -- --        |";C=readln(data);txt "!"C"|";txt "·                                                          +- ---  ---     |";D=readln(data);txt "|"D"|";txt "|                                                          +-- - ---- --   |";E=readln(data);txt "|"E"!";txt ":                                                          +-- -- - ---    :";F=readln(data);txt ":"F"·";txt "·                                                          +- - -- -       .";G=readln(data);txt ":"G":";txt ".                                                          +- - --- -      .";H=readln(data);txt "·"H"|";txt ":                                                          +- --- -- --    |";I=readln(data);txt "|"I"·";txt ":                                                          +- - -----      |";J=readln(data);txt "|"J":";txt "[1m`--------------------------------------------------------------------------'";txt "";txt ".--------------------------------------------------- ------ - --- - - -- -->";txt "|                                                                          ";txt "`------------------------------------------------- ------------- ----- -- ->";SM BLU'[1C[2A'YEL' Give A Line To The Gods [Y/N]? [36m: 'GRN;GC;key=result;if key="y" then do;TXT "yEAH!";call yes;END;if key="Y" then do;TXT "yEAH!";call yes;END;txt '[32mnOWAY dUDE![1B';SHUTDOWN;EXIT;YES:;SM BLU'[1C[1A'YEL' Chose Color [35m['blu'1[35m] [35m['red'2[35m] [35m['grn'3[35m] [35m['mag'4[35m] [35m['cyn'5[35m] [35m['yel'6[35m] [36m>: 'GRN;GC;key=result;if key='' then do;COL="[0m";TXT COL"WHITE!";end;if key='1' then do;COL=BLU;txt COL"BLUE!";end;if key='2' then do;COL=RED;txt COL"RED!";end;if key='3' then do;COL=GRN;txt COL"GREEN!";end;if key='4' then do;COL=MAG;txt COL"MAGENTA!";end;if key='5' then do;COL=CYN;txt COL"CYAN!";end;if key='6' then do;COL=YEL;txt COL"YELLOW!";end;txt LEFT('[1C[1A',86);QUERY BLU'[1C[1A[33m[3mTEXT [0m[36m>: 'COL;TEXT=RESULT;if text="" then do;call quit;end;txt LEFT('[1C[1A',86);if axx<"240" then do;SM "[1C"YEL"[3m[1ADo you wan't to be Private [Y/N]? ";GC;AN=RESULT;end;if axx>"240" then do;SM "[1C"YEL"[3m[1ADo you wan't to be Private [Y/N/F]? ";GC;AN=RESULT;if AN="F" then do;TXT "";txt LEFT('[1C[1A',86);QUERY BLU'[1C[1A[33m[3mSysop Option Fake Handle MAX 15 CHARS [0m[36m>: 'GRN;NAME=RESULT;HAND=NAME;end;if AN="f" then do;TXT "";txt LEFT('[1C[1A',86);QUERY BLU'[1C[1A[33m[3mSysop Option Fake Handle MAX 15 CHARS [0m[36m>: 'GRN;NAME=RESULT;if name="" then do;name=RHAND;end;HAND="0011011011100111011";end;end;CLOSE(DATA);OPEN(DATA,"doors:tzz/wally96/wally96.sys",W);WRITELN(DATA,B);WRITELN(DATA,C);WRITELN(DATA,D);WRITELN(DATA,E);WRITELN(DATA,F);WRITELN(DATA,G);WRITELN(DATA,H);WRITELN(DATA,I);WRITELN(DATA,J);WRITELN(DATA,' 'COL''CENTER(TEXT,57)'[34m|[33m'RIGHT(RHAND,15)"[34m");IF AN="Y" then do;NAME="Private!";TXT "Private!";END;IF AN="y" then do;NAME="Private!";TXT "[0mPrivate!";END;IF HAND=NAME then do;txt "[0mPublic!";END;IF HAND="0011011011100111011" then do;END;CLOSE(DATA);OPEN(DATA,"doors:tzz/wally96/wally96.data",W);WRITELN(DATA,B);WRITELN(DATA,C);WRITELN(DATA,D);WRITELN(DATA,E);WRITELN(DATA,F);WRITELN(DATA,G);WRITELN(DATA,H);WRITELN(DATA,I);WRITELN(DATA,J);WRITELN(DATA,' 'COL''CENTER(TEXT,57)'[34m|[33m'RIGHT(NAME,15)"[34m");txt '[1B';SHUTDOWN;EXIT;quit:;txt '[1B';SHUTDOWN;EXIT