parse arg node;options results;signal on ioerr;signal on error;signal on halt;nodeid="AERexxControl"node;address value nodeid;address command "BBS:DOORS/LaW/LaW.DaT" node;address command f1 node;if (show('p',nodeid)) then;do;address value nodeid;tr 'fATAL eRROR!! ...wHAT hAVE yOU dONE ?¿';shutdown;end;exit;Ioerr:;Error:;Halt:;if (show('p',nodeid)) then;do;address value nodeid;tr 'fATAL eRROR!! ...wHAT hAVE yOU dONE ?¿';shutdown;end;exit;return