/* Optimized with RexxOpt 1.8 */
parse arg node;options results;nodeid="AERexxControl"node;tr=transmit;GU=GetUser;ss=sendstring;hk=getchar;qu=query;ZMODEMSEND=137;address value nodeid;LF=D2C('10');CLS=D2C('12');CR=D2C('13');CRLF=CR||LF;gu 11;bbsname=result;signal on syntax;signal on error;FALSE=0;TRUE=1;main:;tr CLS;tr "        [36m                                                    _       ";tr "                                                           /        ";tr "        _[34m .-----------------------------------------------[36m/[34m-----. [36m_ ";tr "         \[34m|   [39mSuck iP Noticer v1.0 (c) 1997 bY: nOp!/SAiNTS    [34m |[36m/  ";tr "          \                                                    _/   ";tr "         [34m |  [39m  Should using with Miami Any Version!  [36m _     _[34m   |   ";tr "          `-[36m\[34m-----------------------------------------[36m/[34m-----[36m/[34m---'   ";tr "         [36m    \_                                      /     /        ";ss "          [39m Current iP of "bbsname" : ";Showfile ('env:hostname');tr " ";tr " ";Quit:;shutdown;exit;end