/* Optimized with RexxOpt 1.4 */
OPTIONS RESULTS;PARSE ARG NODE;NODEID = 'AERexxControl'NODE;ADDRESS VALUE NODEID;ZEIT=TIME(M);OPEN('JAJA','RAM:GEHEN.MZT.'NODE,'W');ZEITTEXT=WRITELN(JAJA,ZEIT);ZEITTEXT=CLOSE(JAJA);SHUTDOWN;EXIT