/* Optimized with RexxOpt 1.6 */
PARSE ARG node;BackSpace='[D';CursorUp='[A';EraseEOL='[K';FormFeed='[0;0H[J';spinflag=1;node=STRIP(node);nodeid="AERexxControl"node;tr=TRANSMIT;ss=SENDSTRING;gu=GETUSER;gc=GETCHAR;DT_NAME=100;path="DOORS:OMN/Death/";OPTIONS RESULTS;SIGNAL ON ERROR;SIGNAL ON SYNTAX;SIGNAL ON IOERR;ADDRESS VALUE nodeid;tr "[0m"formfeed;CALL ADDLIB('rexxarplib.library',0,-30);CALL ADDLIB('rexxsupport.library',0,-30,0);IF ~SHOW('L',"rexxarplib.library") THEN;DO;tr;tr "[37mCouldn't load rexxarplib.library! Please tell "sysopname"![0m";tr;SHUTDOWN;EXIT;END;IF ~SHOW('L',"rexxsupport.library") THEN;DO;tr;tr "[37mCouldn't load rexxsupport.library! Please tell "sysopname"![0m";tr;SHUTDOWN;EXIT;END;ss "[32mLoading data files...  [0m";CALL spin;IF ~EXISTS(path"Death.dat") THEN;DO;CALL OPEN(dat,path"Death.dat",WRITE);CALL WRITELN(dat,C2X("None_0"));CALL CLOSE(dat);END;CALL spin;CALL OPEN(dat,path"Death.dat",READ);x=READLN(dat);CALL CLOSE(dat);CALL spin;y=X2C(x);x=POS("_",y);highname.1=SUBSTR(y,1,x-1);highscore.1=SUBSTR(y,x+1,LENGTH(y)-x);CALL spinok;GU DT_NAME ;username=RESULT;Main:;CALL show_header_screen;tr;tr COPIES(" ",28)"[35m.----------------------.";tr COPIES(" ",28)"| [34m[[37m1[34m]  [33msTART tHE gAME  [35m|";tr COPIES(" ",28)"| [34m[[37m2[34m]  [33msEE dEATH rULEZ [35m|";tr COPIES(" ",28)"| [34m[[37m3[34m]  [33msEE mEGA sCORES [35m|";tr COPIES(" ",28)"| [34m[[37m4[34m]  [33mcHICKEN oUT :)  [35m|";tr COPIES(" ",28)"`----------------------'";tr;Main_GetKey:;minkey=1;maxkey=4;getkey_txt=COPIES(" ",23)"[32msO wHAT'S yOUR cHOICE [35m([36m1[35m/[36m2[35m/[36m3[35m/[36m4[35m)[32m? ";CALL ask_getkey;SELECT;WHEN key=1 THEN SIGNAL start_game;WHEN key=2 THEN SIGNAL show_death_rules;WHEN key=3 THEN SIGNAL show_high_scores;WHEN key=4 THEN SIGNAL quit;OTHERWISE SIGNAL main;SIGNAL main;Start_Game:;DO x=1 TO 4;dice.x=0;END;round=0;credits=0;CALL show_header_screen;tr;CALL show_init_plate;CALL show_update_plate;SG_Roll_Again:;yn_txt=COPIES(" ",29)"[32mrEADY tO rOLL [35m([36mY[35m/[36mN[35m)[32m? ";CALL ask_yn;IF key=="N" THEN;DO;yn_txt=COPIES(" ",31)"[32maRE u sURE [35m([36mY[35m/[36mN[35m)[32m? ";CALL ask_yn;IF key=="Y" THEN SIGNAL sg_check_highscore;SIGNAL sg_roll_again;END;CALL su_clear;DO y=1 TO RANDOM(1,20,TIME(SEC));DO x=1 TO 4;dice.x=RANDOM(1,12,TIME(SEC));END;END;round=round+1;CALL su_dices;tr "[21;1H";IF dice.1== dice.2 THEN;DO;tr "[37m"CENTER("!!!Death rolls DEATH!!!",80);tr "[32m"CENTER("You gain "||(dice.3+dice.4)*2||" credz !!",80);tr;credits=credits+(2*(dice.3+dice.4));SIGNAL sg_ask_continue;END;IF dice.3== dice.4 THEN;DO;tr "[37m"CENTER("!!!You roll DEATH!!!",80);tr "[32m"CENTER("Death gains "||(dice.1+dice.2)*2||" of your credz!",80);tr;credits=credits-(2*(dice.1+dice.2));SIGNAL sg_ask_continue;END;IF dice.1+dice.2== dice.3+dice.4 THEN;DO;tr "[33m"CENTER("Equal!",80);tr;SIGNAL sg_ask_continue;END;IF dice.1+dice.2> dice.3+dice.4 THEN;DO;tr "[33m"CENTER("Death wins this round!",80);tr "[32m"CENTER("Death gains "||(dice.1+dice.2)||" of your credz!",80);tr;credits=credits-(dice.1+dice.2);SIGNAL sg_ask_continue;END;IF dice.1+dice.2< dice.3+dice.4 THEN;DO;tr "[33m"CENTER("You win this round!",80);tr "[32m"CENTER("You gain "||dice.3+dice.4||" credz!",80);tr;credits=credits+dice.3+dice.4;SIGNAL sg_ask_continue;END;SIGNAL quit;SG_Ask_Continue:;CALL su_other;SIGNAL sg_roll_again;SG_Check_HighScore:;IF credits>highscore.1 THEN;DO;highname.1=username;highscore.1=credits;CALL su_clear;tr "[20;1H[37m"CENTER("cONGRATULATIONS - u'VE bEATEN tHE hIGHSCORE!!!",80);tr;CALL ask_anykey;CALL save_highscores;END;SIGNAL main;Show_High_Scores:;SIGNAL main;Show_Death_Rules:;CALL show_header_screen;tr "[33m";tr CENTER("tHE rULEZ oF dEATH!",80);tr "[32m";tr CENTER("Let's imagine that u have one 2d6 dice in each hand. Then u roll them",80);tr CENTER("separately from each other so that the 2*2d6 dices are rolled from each",80);tr CENTER("hand without mixing them. Now u look at them and if they are equal (Eg.",80);tr CENTER("6-6) then u've rolled DEATH and death will take 2 * the sum of his dices",80);tr CENTER("(Eg. If u rolled 4-4 and he rolled 5-6 then he would take 22 credits)",80);tr CENTER("If Death's dices are equal then u'll gain 2 * the sum of ur dices!!",80);tr CENTER("When they are different then if ur dice sum is lower than death's. He",80);tr CENTER("will take his dice sum from ur credz. If ur dice sum is higher than",80);tr CENTER("his, u'll gain the sum of ur dices in credz! (Eg. If death rolls 4-5 and",80);tr CENTER("u roll 6-6 then u'll gain 12 credz) If both ur and death's dice sum is",80);tr CENTER("equal then nothing will happen!",80);tr "[33m";tr CENTER("gOOD lUCK... u'LL nEED iT!!",80);tr;CALL ask_anykey;SIGNAL main;Show_Init_Plate:;tr "[10;1H";tr COPIES(" ",14)"[35m.-----------.----------.-------.-----.-------------.";tr COPIES(" ",14)"|[32m(C)1994!!!![35m|  [33mrESULT  [35m|[33mcURRENT[35m|[33mrOUND[35m|  [33maLL tIMES  [35m|";tr COPIES(" ",14)"|[32m7H3 ()M3/\/[35m| [33moF dIZES [35m| [33mcREDZ [35m| [33mnR. [35m| [33mmEGA dEATH! [35m|";tr COPIES(" ",14)":-----------:----..----:-------:-----:-------------:";tr COPIES(" ",14)"| [32mdEATH     [35m|    ||    | [32muNLIM [35m|     | [36m"LEFT(highname.1,11)" [35m|";tr COPIES(" ",14)":-----------:----::----:-------:     | [33m       wITH [35m|";tr COPIES(" ",14)"| [32myOU       [35m|    ||    |       |     | [36m"RIGHT(highscore.1,5)" [33mcREDZ [35m|";tr COPIES(" ",14)"`-----------^----^^----^-------^-----^-------------'";RETURN;Show_Update_Plate:;CALL su_dices;CALL su_other;CALL su_clear;RETURN;SU_Dices:;IF LENGTH(dice.1)==1 THEN ss "[36m[15;29H0"dice.1;ELSE ss "[36m[15;29H"dice.1;IF LENGTH(dice.2)==1 THEN ss "[15;35H0"dice.2;ELSE ss "[15;35H"dice.2;IF LENGTH(dice.3)==1 THEN ss "[17;29H0"dice.3;ELSE ss "[17;29H"dice.3;IF LENGTH(dice.4)==1 THEN ss "[17;35H0"dice.4;ELSE ss "[17;35H"dice.4;tr "[19;1H";RETURN;SU_Other:;ss "[36m[16;48H   ";ss "[16;48H"round;ss "[17;40H     ";ss "[17;40H"credits;tr "[19;1H";RETURN;SU_Clear:;ss "[22;1H"eraseeol;ss "[23;1H"eraseeol;tr "[19;1H";RETURN;Show_Header_Screen:;tr formfeed||COPIES(" ",14)"                       [35m /\_  /\_ /\_ /\___  ___";tr COPIES(" ",14)"                       |   \|   |   |_  _/||  /";tr COPIES(" ",14)"[32mwELCOME tO tHE gAME oF [35m| \  \  -| o || || || |  [32mv0.1b";tr COPIES(" ",14)"                       [35m| /  /  -| | || +|    | ";tr COPIES(" ",14)"                       :.../:...:.| ::.::.:: : ";tr COPIES(" ",14)"                                  :.:      :.: ";tr "[32m";tr CENTER("bY mELODY / 7H3 ()M3/\/",80);tr CENTER("& sPELLBINDER / 7H3 ()M3/\/",80);RETURN;Spin:;IF spinflag<1|spinflag>4 THEN spinflag=1;IF spinflag==4 THEN;DO;ss BackSpace"[35m\";spinflag=5;RETURN;END;IF spinflag==3 THEN;DO;ss BackSpace"[35m-";spinflag=4;RETURN;END;IF spinflag==2 THEN;DO;ss BackSpace"[35m/";spinflag=3;RETURN;END;IF spinflag==1 THEN;DO;ss BackSpace"[35m|";spinflag=2;RETURN;END;RETURN;SpinErr:;ss BackSpace"[37mERROR![0m";tr;RETURN;SpinOK:;ss BackSpace"[32mDONE![0m";tr;RETURN;Save_HighScores:;CALL OPEN(dat,path"Death.dat",WRITE);CALL WRITELN(dat,C2X(highname.1"_"highscore.1));CALL CLOSE(dat);RETURN;Ask_AnyKey:;ss COPIES(" ",24)"[35m([32mpAUSED[35m)...[36maNY kEY tO cONTINUE![0m";GC ;key=UPPER(RESULT);tr;tr cursorup||eraseeol||cursorup;RETURN;Ask_GetKey:;ss getkey_txt;GC ;key=STRIP(UPPER(RESULT));tr "[36m"key"[0m";IF key== D2C(13) THEN RETURN;IF key<minkey|key>maxkey THEN;DO;tr cursorup||eraseeol||cursorup;SIGNAL ask_getkey;END;DROP minkey;DROP maxkey;RETURN;Ask_YN:;ss yn_txt;GC ;key=UPPER(RESULT);tr "[36m"key"[0m";IF key ~=="Y"&key ~=="N" THEN;DO;tr cursorup||eraseeol||cursorup;SIGNAL ask_yn;END;tr cursorup||eraseeol||cursorup;RETURN;Error:;tr "[0mERROR! "ERRORTEXT(rc)" in line "sigl;SIGNAL error_quit;IOError:;tr "[0mI/O ERROR! "ERRORTEXT(rc)" in line "sigl;SIGNAL error_quit;Syntax:;tr "[0mSYNTAX ERROR! "ERRORTEXT(rc)" in line "sigl;SIGNAL error_quit;Quit:;Error_Quit:;tr;SHUTDOWN;EXIT