/* Optimized with RexxOpt 1.4 */
parse arg node;options results;nodeid = "AERexxControl"node;tr=transmit;hk=getchar;sendstring=sendmessage;ss=sendstring;gu=getuser;pu=putuser;signal on error;signal on syntax;signal on ioerr;qe=query;hk=getchar;address value nodeid;gu 100;walter=1;username = result;gu 142;chat=result;gu 12;sysopname=result;gu 105;userlevel=result;gu 117;upload=result;beep='. ';if ~exists('bbs:modules/absturz/creditspage/creditspage.cfg') then do;tr '';tr 'Sorry no configfile please create it !!!';tr '';shutdown;exit;end;call callerslog2;Open('gg',"bbs:modules/absturz/creditspage/creditspage.cfg","R");chatover = ReadLN('gg');biep = readln('gg');max = readln('gg');close('gg');if userlevel < Chatover then do;if chat='OFF' then do;tr '';tr 'Sorry, 'username', 'sysopname' is not around right now !';query 'Do you want to leave him a comment ? (Y/n) : ';schroedel=UPPER(result);if schroedel= '' then do;call pornodoescher;end;if schroedel= 'Y' then do;call pornodoescher;end;if schroedel= 'N' then do;shutdown;exit;end;SHUTDOWN;EXIT;end;end;ok=0;gu 100;USER = result;USER = UPPER(USER);If exists("bbs:modules/absturz/creditspage/creditspage.names")then;if Open('walter',"bbs:modules/absturz/creditspage/creditspage.names","R") then do;Do Until eof('walter');NAME = ReadLN('walter');name = upper(name);If USER = NAME & OK = 0 then OK = 1;End;Close ('walter');End;if ok = 0 then call start;if ok = 1 then do;kk=TRUNC(upload/biep);if kk > max then kk=max;tr '';tr ' [37;1m------------------------------------------------------------------------------[0m';tr ' [44;33m               CHAT-OVERiDE-EMERGENCY-CREDiTS-PAGE VERSiON 1.10               [0m';tr ' [44;33m                                                                              [0m';tr ' [44;33m  WRiTTEN BY MuMu & nEW uSER OF OSiRiS - CALL KEY WEST TO GET LATEST UPDATES  [0m';tr ' [37;1m------------------------------------------------------------------------------[0m';tr '';tr ' [31m- [32mFree mode aktivated [31m-[0m ';tr '';tr 'Now you can enter the number of beeps';tr 'The maximum is 'max;tr 'One Beep will cost nothing';tr '';tr 'You have uploaded 'upload' bytes';tr '';query 'Please enter the number of beeps you want (max 'max') : ';jau=result;soso=jau;if jau = '?' then call help;if jau = '' then call abort;if jau = '0' then call abort;if jau > max then call dreck;walter = 1;jau=jau+1;do UNTIL jau = walter;address command ('c:wait 1');ss beep;walter=walter+1;end;tr '';tr '';tr 'Ok i have send 'soso' beeps this will cost ya nothing.';tr '';tr '==========================================';tr ' Uploaded bytes     | 'upload;tr '                    |                    -';tr ' PageCredits        | [32mFree mode aktiv[0m';tr '==========================================';tr ' New uploaded bytes | [31m'upload;tr '[0m==========================================';tr '';shutdown;exit;end;end;start:;if upload = '0' then do;tr '';tr '';tr 'Sorry you cant page the sysop you only have 0 bytes upload credits ';tr '';tr 'Try to upload something and try to page again.....';shutdown;exit;end;kk=TRUNC(upload/biep);if kk > max then kk=max;tr '';tr ' [37;1m------------------------------------------------------------------------------[0m';tr ' [44;33m               CHAT-OVERiDE-EMERGENCY-CREDiTS-PAGE VERSiON 1.10               [0m';tr ' [44;33m                                                                              [0m';tr ' [44;33m  WRiTTEN BY MuMu & nEW uSER OF OSiRiS - CALL KEY WEST TO GET LATEST UPDATES  [0m';tr ' [37;1m------------------------------------------------------------------------------[0m';tr '';tr 'Now you can enter the number of beeps';tr 'The maximum is 'kk;tr 'One Beep will cost 'biep' bytes';tr '';tr 'You have uploaded 'upload' bytes';tr '';query 'Please enter the number of beeps you want (max 'kk') : ';jau=result;soso=jau;if jau = '?' then call help;if jau = '' then call abort;hehe = TRUNC(jau*biep);if jau = '0' then call abort;if hehe < jau then call son;if jau > kk then call dreck;if upload < hehe then call scheiss;jau=jau+1;do UNTIL jau = walter;address command ('c:wait 1');ss beep;walter=walter+1;end;tr '';tr '';tr 'Ok i have send 'soso' beeps this will cost ya 'hehe' bytes.';tr '';tr '==========================================';tr ' Uploaded bytes     : 'upload;tr '                    :                    -';tr ' PageCredits        : 'hehe;tr '==========================================';mm=TRUNC(upload-hehe);tr ' New uploaded bytes : [31m'mm;tr '[0m==========================================';putustr mm;putuser 117;tr '';shutdown;exit;end;dreck:;tr '';tr '';tr 'You have selected 'soso' beeps but the maximum is 'kk' !!!';tr '';tr 'Try again';tr '';shutdown;exit;son:;tr '';tr '';tr '';tr 'sorry you only have 'upload' bytes but you need 'hehe' bytes to';tr 'send 'soso' beeps to the sysop';tr '';shutdown;exit;scheiss:;tr '';tr '';tr '';tr 'Sorry you dont have enough credtis to beep 'soso' times';tr '';pornodoescher:;Putustr 'C';putuser 136;SHUTDOWN;exit;CallersLog2:;if Open(FileHandle,'BBS:node'||node||'/Callerslog','A') == 1 then do;garbage=Seek(FileHandle,0,'E');garbage=WriteLN(FileHandle,'09'X||"Operator Paged at ("TIME('N')")");garbage=Close(FileHandle);end;else do;tr '';tr "Error writing Callerslog!";tr '';end;return;help:;tr '';tr '';tr '                     _____   _____   ____ _____  _________';tr '                    /  _  \_/   _/__/___/_\_   \/___/   _/__';tr '                   /   /   /___    /   /   /   /   /___    /';tr '                  /       /   /   /   /  _   _/   /   /   /';tr '                  \______/_______/___/___\___\___/_______/Co';tr '';tr '                 CHAT-OVERiDE-EMERGENCY-CREDiTS-PAGE VERSiON';tr '';tr '                        CALL KEY WEST FOR MORE iNFOS';tr '';shutdown;exit;abort:;tr' Aborted.....';tr '';shutdown;exit;ERROR:;tr;transmit 'An error in Line.. #'sigl' Exiting..';tr errortext(sigl);SHUTDOWN;exit;SYNTAX:;tr;transmit 'An error in Line.. #'sigl' Exiting..';tr errortext(sigl);SHUTDOWN;exit;IOERR:;tr;transmit 'An error in Line.. #'sigl' Exiting..';tr errortext(sigl);SHUTDOWN;exit;ende:;tr 'Exiting.................';SHUTDOWN;exit