/* Optimized with RexxOpt 1.5 */
/*     SOME-INFO V1.0b BY MR.ORION / REBELS IN 1994 */;parse arg node;options results;nodeid = "AERexxControl"node;address value nodeid;signal on syntax;signal on ioerr;bufferflush;tr = transmit ;hk = getchar ;pm = prompt ;sendstring = sendmessage;ss = sendstring ;gu = getuser ;pu = putuser;CLS = D2C(12);NOR='[0m';RED='[31m';GRN ='[32m';YEL='[33m';BLU='[34m';MAG='[35m';CYN='[36m';REDYEL='[41;33m';WHTRED='[47;31m';gu 11 ;bbs=result;gu 12 ;sysop=result;gu 100;user=result;gu 102;userloc=result;gu 103;phone=result;gu 104;slot=result;gu 105;access=result;gu 106;ra=result;gu 109;msg=result;gu 110;nrup=result;gu 112;tm=result;gu 117;byteup=result;gu 111;nrdn=result;gu 118;bytedn=result;gu 119;bytelim=result;gu 115;time=result;gu 142;chat=result;gu 149;nodenr=result;gu 503;devi=result;gu 505;inbaud=result;gu 516;baud=result;tr cls;tr "       ================================================================";tr "                   "BLU"SOME-INFO V0.1b"NOR" BY"CYN" MR.ORION / REBELS"NOR"             ";tr "                                  "GRN"IN 1994"MAG"";tr "       ================================================================";tr "                          YOUR HANDLE IS : "CYN""user;tr "                           YOUR LOCATION : "MAG""userloc;tr "                    YOUR PHONE NUMBER IS : "CYN""phone;tr "       ================================================================";tr "                           YOUR SYSOP IS : "MAG""sysop;tr "                     YOUR ACCES LEVEL IS : "CYN""access;tr "                             BBS NAME IS : "MAG""bbs;tr "       ================================================================";tr "                            BYTES UPLOAD : "CYN""byteup;tr "                          BYTES DOWNLOAD : "MAG""bytedn;tr "                  NUMBER'S OF DOWNLOAD'S : "CYN""nrdn;tr "                    NUMBER'S OF UPLOAD'S : "MAG""nrup;tr "                           BYTES LIMITED : "CYN""bytelim;tr "                              RATIO TYPE : "MAG""ra;tr "                            TIMES CALLED : "CYN""tm;tr "       ================================================================";tr "                          TIME AVAILABLE : "MAG""time;tr "                NUMBER OF MESSAGE POSTED : "CYN""msg;tr "                     USER ACCOUNT NUMBER : "MAG""slot;tr "       ================================================================";tr "  ";call dexit;/*==========================================================================*/;IOERR: tr "I/O Error: Missing File/Directory";ERROR:;SYNTAX: tr "Error in Line.. #"sigl" Exiting.." ;tr errortext(sigl);/*==========================================================================*/;DExit: bufferflush ;ShutDown ;Exit;prompt: procedure ;parse arg message,length ;RECEIVE length ;QUERY message ;return result;putvar: procedure ;parse arg string1,string2 ;PUTUSTR string1 ;PUTUSER string2 ;return 0;getvar: procedure ;parse arg string1 ;getuser string1 ;return result