/* sTRIP tHE aDDS  */

parse arg node
options results
nodeid = "AERexxControl"node
address value nodeid
signal on error;signal on ioerr;signal on syntax
TR=TRANSMITT ; GC=GETCHAR ; SS=SENDMESSAGE; GU=GETUSER

TR "[34m[42m(-sTRIP bBS aDDIES 0.1-)                  Coded By gONZALEZ/M! & jOE cOOl/M![0m"

GETUSER 131; MAINLINE=RESULT

FULLPATH=COMPRESS(DELWORD(MAINLINE,1,1))
FILE=COMPRESS(RIGHT(FULLPATH,LENGTH(FULLPATH)-LASTPOS("/",FULLPATH)),"""")
FILE=RIGHT(FILE,LENGTH(FILE)-LASTPOS(":",FILE))
END=RIGHT(FILE,LENGTH(FILE)-LASTPOS(".",FILE))

IF EXISTS("BBS:DOORS/FILEID/sTRIPADDS.cHECK") THEN OPEN("CONFIG1","BBS:DOORS/FILEID/sTRIPADDS.cHECK","R")
ELSE OUTHERE()
IF EXISTS("BBS:DOORS/FILEID/sTRIPADDS.sTRIP") THEN OPEN("CONFIG2","BBS:DOORS/FILEID/sTRIPADDS.sTRIP","R")
ELSE OUTHERE()
IF EXISTS("T:FILE_ID.DIZ") THEN DO
 ADDRESS COMMAND "PROTECT T:FILE_ID.DIZ +D >NIL:"
 ADDRESS COMMAND "DELETE T:FILE_ID.DIZ >NIL:"
END
IF EXISTS("T:FILE_ID.DIZ2") THEN DO
 ADDRESS COMMAND "PROTECT T:FILE_ID.DIZ2 +D >NIL:"
 ADDRESS COMMAND "DELETE T:FILE_ID.DIZ2 >NIL:"
END

z=0
DO WHILE EOF("CONFIG1")=0
 KINDS=READLN("CONFIG1")
 IF EOF("CONFIG1")=1 THEN OUTHERE()
 SHELLX=READLN("CONFIG1")
 SHELLD=READLN("CONFIG1")
 SHELLA=READLN("CONFIG1")
 NUMKINDS=WORDS(KINDS)
 IF NUMKINDS=0 THEN z=1
 DO i=1 TO NUMKINDS
  IF UPPER(WORD(KINDS,i))=UPPER(END) THEN DO
   POSITION=INDEX(SHELLX,"{#}")
   SHELLX=INSERT(FULLPATH,DELSTR(SHELLX,POSITION,3),POSITION-1)
   ADDRESS COMMAND SHELLX
   z=1
  END
  IF z=1 THEN LEAVE
 END
 IF z=1 THEN LEAVE
END

home:
DO WHILE EOF("CONFIG2")=0
 SUCK=READLN("CONFIG2")


 IF EXISTS("T:FILE_ID.DIZ") THEN OPEN("FILE_ID","T:FILE_ID.DIZ","R")
 ELSE TR "sORRY, FILE_ID.DIZ nOT fOUND !";raus 

 OPEN("File_W","t:FILE_ID.DIZ2","W")
 DO WHILE EOF("FILE_ID")=0
  EINGABE=READLN("FILE_ID")
 
  IF POS(UPPER(suck),UPPER(eingabe))=0 THEN DO
   IF EOF("FILE_ID")=0 THEN WRITELN("File_W",eingabe)
   ELSE WRITECH("File_W",eingabe)
  END 
  ELSE DO
   TR "(-dELETING: % "eingabe" %-)"
   x=1
  END
 END
 weiter:
 
 CLOSE("File_W");CLOSE("FILE_ID")
 
 ADDRESS COMMAND "DELETE T:FILE_ID.DIZ >NIL:"
 ADDRESS COMMAND "RENAME T:FILE_ID.DIZ2 T:FILE_ID.DIZ >NIL:"

END
CLOSE("CONFIG2")
IF x=1 THEN DO
 POSITION=INDEX(SHELLD,"{#}")
 SHELLD=INSERT(FULLPATH,DELSTR(SHELLD,POSITION,3),POSITION-1)
 ADDRESS COMMAND SHELLD
 
 POSITION=INDEX(SHELLA,"{#}")
 SHELLA=INSERT(FULLPATH,DELSTR(SHELLA,POSITION,3),POSITION-1)
 ADDRESS COMMAND SHELLA
END

OUTHERE:
raus:
error:
ioerr:
syntax:


comm=insert("examin1 ",fullpath)
putustr comm
putuser 508



shutdown;
exit;
