/* Optimized with RexxOpt 1.6 */
PARSE ARG node;BackSpace='[D';Bell='07'X;CursorUp='[A';EraseEOL='[K';FormFeed='[0;0H[J';CrsrOff='[0 p';CrsrOn='[ p';spinflag=1;node=STRIP(node);nodeid="AERexxControl"node;tr=TRANSMIT;se=SENDMESSAGE;ss=SENDSTRING;gu=GETUSER;gc=GETCHAR;pu=PUTUSER;pv=PUTUSTR;DT_NAME=100 ;DT_PASSWORD=101 ;DT_LOCATION=102;DT_PHONENUMBER=103 ;DT_SLOTNUMBER=104 ;DT_ACCESSLEVEL=105;DT_RATIOTYPE=106 ;DT_RATIO=107 ;DT_COMPTYPE=108;DT_MESSAGESPOSTED=109 ;DT_UPLOADS=110 ;DT_DOWNLOADS=111;DT_TIMESCALLED=112 ;DT_TIMELASTON=113 ;DT_TIMEUSED=114;DT_TIMELIMIT=115 ;DT_TIMETOTAL=116 ;DT_BYTESUPLOAD=117;DT_BYTEDOWNLOAD=118 ;DT_DAILYBYTELIMIT=119 ;DT_DAILYBYTEDLD=120;DT_EXPERT=121 ;DT_LINELENGTH=122 ;DT_CURR_TIME=145;ZMODEMSEND=137 ;ZMODEMRECEIVE=138 ;BB_MAINLINE=131;JH_EF=9 ;BB_DROPDTR=511 ;JH_SYSOP=12;JH_BBSNAME=11 ;BB_NONSTOPTEXT=525;exepath="DOORS:OMN/MegaOffer/";datapath="DOORS:OMN/MegaOffer/Data/";tmppath="DOORS:OMN/MegaOffer/Temp/";sysaxx=255;OPTIONS RESULTS;SIGNAL ON ERROR;SIGNAL ON SYNTAX;SIGNAL ON IOERR;ADDRESS VALUE nodeid;CALL ADDLIB('rexxarplib.library',0,-30);CALL ADDLIB('rexxsupport.library',0,-30,0);IF ~SHOW('L',"rexxarplib.library") THEN;DO;tr;tr "[37mcOULDN'T lOAD 'rexxarplib.library'! pLEASE nOTIFY tHE sYSOP![0m";tr;SIGNAL error_quit;END;IF ~show('L',"rexxsupport.library") THEN;DO;tr;tr "[37mcOULDN'T lOAD 'rexxsupport.library'! pLEASE nOTIFY tHE sYSOP![0m";tr;SIGNAL error_quit;END;tr formfeed;spintxt="lOADING dATA fILES...";CALL spinstart;IF ~EXISTS(datapath) THEN ADDRESS COMMAND "MakeDir "LEFT(datapath,LENGTH(datapath)-1);CALL load_users;CALL load_msg;CALL spinok;CALL CLOSE(dat);GU DT_NAME ;userhandle=RESULT;GU DT_LINELENGTH ;userpage=RESULT;GU DT_ACCESSLEVEL ;useraxx=RESULT;GU BB_MAINLINE ;mainline=RESULT;reqmode=1;IF STRIP(WORD(mainline,2))=="" THEN SIGNAL ro_pre;reqmode=0;Main:;CALL show_header;tr COPIES(" ",17)"[35m- -= -= -+--=-=-=-=-=-=-=-=-=-=-=-=-+- =- =- -";tr COPIES(" ",17)"         : [34m[[37m1[34m]  [33mrEAD oFFERS         [35m:";tr COPIES(" ",17)"         . [34m[[37m2[34m]  [33meNTER a nEW oFFER   [35m.";tr COPIES(" ",17)"         . [34m[[37m3[34m]  [33mrEAD iNSTRUCTIONS   [35m.";tr COPIES(" ",17)"         : [34m[[37m4[34m]  [33mqUIT                [35m:";tr COPIES(" ",17)"  -= -= -+-=-=-=-=-=-=-=-=-=-=-[32mV0.1b[35m+- =- =-";tr COPIES(" ",17)"         :                          :[0m";tr;Main_GetKey:;minkey=1;maxkey=5;getkey_txt=COPIES(" ",31)"[32mcHOOSE [35m([36m1[35m/[36m2[35m/[36m3[35m/[36m4[35m)[32m? ";CALL ask_getkey;SELECT;WHEN key=1 THEN SIGNAL read_offer;WHEN key=2 THEN SIGNAL enter_offer;WHEN key=3 THEN SIGNAL read_instructions;WHEN key=4 THEN SIGNAL quit;OTHERWISE SIGNAL main;SIGNAL main;Read_Offer:;tmpmsg=0;IF maxmsg==0 THEN SIGNAL ro_skip_check;IF useraxx>=sysaxx THEN;DO;tmpmsg=1;SIGNAL ro_skip_check;END;DO x=1 TO maxmsg;IF msgstat.x=="VAL" THEN tmpmsg=tmpmsg+1;END;RO_Skip_Check:;IF tmpmsg=0 THEN;DO;tr "[0m"formfeed||crsroff;IF useraxx>=sysaxx THEN tr "[35m.-[[33m#[35m]-.-----[ [33mFROM [35m]-----.-------[ [33mSUBJECT [35m]-------.--[ [33mDATE [35m]---.-[[33mVAL[35m]-.-[[33meND[35m]";ELSE tr "    [35m.-[[33m#[35m]-.-----[ [33mFROM [35m]-----.-------[ [33mSUBJECT [35m]-------.--[ [33mDATE [35m]---.-[[33meND[35m]";IF useraxx>=sysaxx THEN tr "`-----^------------------^-------------------------^-------------^-------^-[[33meND[35m]";ELSE tr "    `-----^------------------^-------------------------^-------------^-[[33meND[35m]";tr;ss "[33m"CENTER("nO tEXT aVAILABLE! aNY kEY tO qUIT!",80)"[0m";GC ;key=STRIP(UPPER(RESULT));SIGNAL ro_quit;END;minnum=1;maxnum=userpage-7;IF userpage>maxmsg+7 THEN maxnum=maxmsg;RO_Page:;posxx=6;IF useraxx>=sysaxx THEN posxx=2;gu bb_nonstoptext;tr "[0m"formfeed||crsroff;IF useraxx>=sysaxx THEN ss "[35m.-[[33m#[35m]-.-----[ [33mFROM [35m]-----.-------[ [33mSUBJECT [35m]-------.--[ [33mDATE [35m]---.-[[33mVAL[35m]-.";ELSE ss "    [35m.-[[33m#[35m]-.-----[ [33mFROM [35m]-----.-------[ [33mSUBJECT [35m]-------.--[ [33mDATE [35m]---.";IF minnum>1 THEN tr "-[[33mpUP[35m]";ELSE tr "-[[33meND[35m]";DO x=minnum TO maxnum;xx=COPIES("0",3-LENGTH(x))||x;val="[37mnOP";IF msgstat.x=="VAL" THEN val="[32myUP";IF msgstat.x=="DELETED" THEN val="[37mdEL";IF useraxx>=sysaxx THEN tr "| [36m"xx" [35m| [36m"LEFT(msguser.x,16)" [35m| [36m"LEFT(msgsubject.x,23)" [35m| [36m"msgdate.x" [35m|  "val"  [35m|";ELSE tr "    | [36m"xx" [35m| [36m"LEFT(msguser.x,16)" [35m| [36m"LEFT(msgsubject.x,23)" [35m| [36m"msgdate.x" [35m|";END;IF useraxx>=sysaxx THEN ss "`-----^------------------^-------------------------^-------------^-------^";ELSE ss "    `-----^------------------^-------------------------^-------------^";IF maxnum<maxmsg THEN tr "-[[33mpDN[35m]";ELSE tr "-[[33meND[35m]";tr;ss COPIES(" ",8)"[33muSE nUMERIC kEYBOARD tO sELECT aND eNTER tO rEAD! [35m([33mq tO qUIT![35m)[0m";IF useraxx>=sysaxx THEN;DO;tr;ss COPIES(" ",18)"[33msYSOP kEYS [35m: [33mt [35m- [33mtOGGLE sTATUS [35m* [33md [35m- [33mdELETE[0m";END;posx=1;ss "["posx+2";"posxx"H>";RO_Scroll:;minkey=1;maxkey=9;x=posx+minnum-1;CALL ask_getkey_b;IF key== D2C(13) THEN;DO;CALL ro_show_msg;SIGNAL ro_page;END;oposx=posx;SELECT;WHEN key="1" THEN posx=maxnum-minnum+1;WHEN key="2" THEN posx=posx+1;WHEN key="3" THEN SIGNAL ro_pagedown;WHEN key="7" THEN posx=1;WHEN key="8" THEN posx=posx-1;WHEN key="9" THEN SIGNAL ro_pageup;WHEN key="Q" THEN SIGNAL ro_quit;WHEN key="T"&useraxx>=sysaxx THEN SIGNAL ro_toggle_status;WHEN key="D"&useraxx>=sysaxx THEN SIGNAL ro_delete_msg;OTHERWISE SIGNAL ro_scroll;END;IF posx>maxnum-minnum+1 THEN posx=maxnum-minnum+1;IF posx<1 THEN posx=1;ss "["oposx+2";"posxx"H ";ss "["posx+2";"posxx"H>";SIGNAL ro_scroll;RO_PageDown:;IF maxnum>=maxmsg THEN SIGNAL ro_scroll;minnum=maxnum+1;maxnum=minnum+userpage-7;IF maxnum>maxmsg THEN maxnum=maxmsg;SIGNAL ro_page;RO_PageUp:;IF minnum<=1 THEN SIGNAL ro_scroll;ominnum=minnum;maxnum=minnum-1;minnum=ominnum-userpage+7-1;IF minnum<1 THEN minnum=1;SIGNAL ro_page;RO_Show_Msg:;tr "[0m"formfeed||crsroff;tr "[1;1H[32mfROM[35m...: [36m"msguser.x;tr "[1;43H[32mnUMBER[35m...: [36m"msgnumber.x;tr "[2;1H[32maBOUT[35m..: [36m"msgsubject.x;tr "[2;43H[32mdATE[35m.....: [36m"msgdate.x;tr;SHOWFILE datapath||msgnumber.x;tr;CALL ask_anykey;RETURN;RO_Quit:;IF reqmode THEN SIGNAL quit;SIGNAL main;RO_Pre:;CALL show_header;CALL ask_anykey;SIGNAL read_offer;RO_Toggle_Status:;IF msgstat.x=="NOT" THEN;DO;msgstat.x="VAL";SIGNAL ro_page;END;msgstat.x="NOT";SIGNAL ro_page;RO_Delete_Msg:;tr "[0m"formfeed||crsroff;tr "[1;1H[32mfROM[35m...: [36m"msguser.x;tr "[1;43H[32mnUMBER[35m...: [36m"msgnumber.x;tr "[2;1H[32maBOUT[35m..: [36m"msgsubject.x;tr "[2;43H[32mdATE[35m.....: [36m"msgdate.x;tr;SHOWFILE datapath||msgnumber.x;tr;yn_txt=COPIES(" ",16)"[33mdO yOU rEALLY wANT tO dELETE tHIS oFFER [35m([36mY[35m/[36mN[35m)[33m? ";CALL ask_yn;IF key=="N" THEN SIGNAL ro_page;msgstat.x="DELETED";CALL DELETE(datapath||msgnumber.x);CALL save_msg;tr "[37m"CENTER("oFFER dELETED!!",80)"[0m";tr;CALL ask_anykey;SIGNAL ro_page;Enter_Offer:;tr "[0m"formfeed||crsron;query "[33meNTER sUBJECT [35m([33meNTER [35m= [33maBORT[35m) : [36m" ;subject=STRIP(RESULT);IF subject=="" THEN SIGNAL main;tr;yn_txt=COPIES(" ",21)"[33mdO yOU wANT tO uPLOAD yOUR tEXT [35m([36mY[35m/[36mN[35m)[33m? ";CALL ask_yn;IF key=="N" THEN SIGNAL eo_skip_upload;IF ~EXISTS(tmppath) THEN ADDRESS COMMAND "MakeDir "LEFT(tmppath,LENGTH(tmppath)-1);pv tmppath;pu ZMODEMRECEIVE;CALL FILELIST(tmppath"#?",fname,F,N);IF fname.0==0 THEN SIGNAL eo_skip_upload;ADDRESS COMMAND "Copy >NIL: "tmppath||fname.1" TO "datapath||nextmsg;CALL DELETE(tmppath||fname.1);SIGNAL eo_ask_msg;EO_Skip_Upload:;tr "[36m"formfeed||crsron;pv datapath||nextmsg;pu JH_EF;tr "[0m"formfeed||crsron;SIGNAL eo_ask_msg;EO_Ask_Msg:;IF ~EXISTS(datapath||nextmsg) THEN SIGNAL main;tr "[0m"formfeed;tr "[1;1H[32mfROM[35m...: [36m"userhandle;tr "[1;43H[32mnUMBER[35m...: [36m"nextmsg;tr "[2;1H[32maBOUT[35m..: [36m"subject;tr "[2;43H[32mdATE[35m.....: [36m"DATE();tr;SHOWFILE datapath||nextmsg;tr;yn_txt=COPIES(" ",29)"[33miS tHIS cORRECT [35m([36mY[35m/[36mN[35m)[32m? ";CALL ask_yn;IF key=="N" THEN;DO;CALL DELETE(datapath||nextmsg);SIGNAL main;END;SIGNAL eo_process_msg;EO_Process_Msg:;IF ~EXISTS(datapath||nextmsg) THEN SIGNAL eo_quit;maxmsg=maxmsg+1;msgnumber.maxmsg=nextmsg;msguser.maxmsg=userhandle;msgsubject.maxmsg=subject;msgdate.maxmsg= DATE();msgstat.maxmsg="NOT";nextmsg=nextmsg+1;CALL save_msg;EO_Quit:;SIGNAL main;Delete_Offer:;tr "[0m"formfeed;SIGNAL main;Read_Instructions:;tr "[0m"formfeed;SIGNAL main;Show_Header:;tr "[0m"formfeed||crsroff||COPIES(" ",14)"[35m_";tr COPIES(" ",13)"/(_____ ___   ___   _     ___   __   _      ______";tr COPIES(" ",13)"\_   _// _ \_/   \_/(____/   \_/  \_/(_______Y    \_";tr COPIES(" ",13)"| \ / Y (_) Y  .__Y     Y     Y    Y    Y    |  O  Y";tr COPIES(" ",13)"|. Y  |. |__|. |__|. O  |. T  |. --|. --|. __|.   /";tr COPIES(" ",13)"|! |  |! |  |! Y  |! _  |! |  |!  _|!  _|! __|! | \";tr COPIES(" ",13)"|i |  |i    |i    |i |  |i :  |i  ||i  ||i   |i |  \";tr COPIES(" ",13)"|  |  |    _|_____|__|__|     |   ||___||____|__|   |";tr COPIES(" ",13)"[33m=[35m\_|_/[33m=[35m\__/[33m==============[35m\___/[33m=[35m\_/[33m=©=sPELLBINDEr=[35m\_/[0m";tr;tr "[32m"CENTER("cODED bY mELODY/7H3 0M3N - aSCII gFX bY sPELLBINDER/7H3 0M3N",80)"[0m";tr;RETURN;Load_Users:;IF ~EXISTS(datapath"Header.usr") THEN;DO;CALL OPEN(dat,datapath"Header.usr",WRITE);CALL CLOSE(dat);END;CALL OPEN(dat,datapath"Header.usr",READ);x=1;DO UNTIL EOF(dat);line=STRIP(READLN(dat));IF line ~=="" THEN;DO;username.x=line;useroffers.x=STRIP(READLN(dat));userlastmsg.x=line;x=x+1;CALL spin;END;END;maxuser=x-1;CALL CLOSE(dat);RETURN;Save_Users:;CALL OPEN(dat,datapath"Header.usr",READ);DO x=1 TO maxuser;CALL WRITELN(dat,username.x);CALL WRITELN(dat,useroffers.x);CALL WRITELN(dat,userlastmsg.x);END;CALL CLOSE(dat);RETURN;Save_Msg:;CALL OPEN(dat,datapath"Header.msg",WRITE);CALL WRITELN(dat,nextmsg);DO x=1 TO maxmsg;IF msgstat.x ~=="DELETED" THEN;DO;CALL WRITELN(dat,msgnumber.x);CALL WRITELN(dat,msguser.x);CALL WRITELN(dat,msgsubject.x);CALL WRITELN(dat,msgdate.x);CALL WRITELN(dat,msgstat.x);END;END;CALL CLOSE(dat);RETURN;Load_Msg:;IF ~EXISTS(datapath"Header.msg") THEN;DO;CALL OPEN(dat,datapath"Header.msg",WRITE);CALL WRITELN(dat,"1");CALL CLOSE(dat);END;CALL OPEN(dat,datapath"Header.msg",READ);nextmsg=STRIP(READLN(dat));x=1;DO UNTIL EOF(dat);line=STRIP(READLN(dat));IF line ~=="" THEN;DO;msgnumber.x=line;msguser.x=READLN(dat);msgsubject.x=READLN(dat);msgdate.x=READLN(dat);msgstat.x=READLN(dat);x=x+1;CALL spin;END;END;maxmsg=x-1;RETURN;SpinStart:;ss crsroff"[32m"spintxt"  ";SIGNAL spin;Spin:;IF spinflag<1|spinflag>4 THEN spinflag=1;IF spinflag==4 THEN;DO;ss BackSpace"[35m\";spinflag=5;RETURN;END;IF spinflag==3 THEN;DO;ss BackSpace"[35m-";spinflag=4;RETURN;END;IF spinflag==2 THEN;DO;ss BackSpace"[35m/";spinflag=3;RETURN;END;IF spinflag==1 THEN;DO;ss BackSpace"[35m|";spinflag=2;RETURN;END;RETURN;SpinErr:;ss BackSpace"[37mERROR![0m"crsron;tr;RETURN;SpinOK:;ss BackSpace"[32mDONE![0m"crsron;tr;RETURN;Ask_AnyKey:;ss crsroff||COPIES(" ",24)"[35m([33mpAUSED[35m)...[33maNY kEY tO cONTINUE![0m";GC ;key=UPPER(RESULT);tr;tr cursorup||eraseeol||cursorup;RETURN;Ask_GetKey:;ss crsron||getkey_txt;GC ;key=STRIP(UPPER(RESULT));tr "[36m"key"[0m";IF key== D2C(13) THEN RETURN;IF key<minkey|key>maxkey THEN;DO;tr cursorup||eraseeol||cursorup;SIGNAL ask_getkey;END;DROP minkey;DROP maxkey;RETURN;Ask_GetKey_B:;ss crsroff;GC ;key=STRIP(UPPER(RESULT));IF key== D2C(13) THEN RETURN;IF key=="Q" THEN RETURN;IF key=="T"&useraxx>=sysaxx THEN RETURN;IF key=="D"&useraxx>=sysaxx THEN RETURN;IF key<minkey|key>maxkey THEN SIGNAL ask_getkey_b;DROP minkey;DROP maxkey;RETURN;Ask_YN:;ss crsron||yn_txt;GC ;key=UPPER(RESULT);tr "[36m"key"[0m";IF key ~=="Y"&key ~=="N" THEN;DO;tr cursorup||eraseeol||cursorup;SIGNAL ask_yn;END;tr cursorup||eraseeol||cursorup;RETURN;Error:;tr "[0mERROR! "ERRORTEXT(rc)" in line "sigl;SIGNAL error_quit;IOError:;tr "[0mI/O ERROR! "ERRORTEXT(rc)" in line "sigl;SIGNAL error_quit;Syntax:;tr "[0mSYNTAX ERROR! "ERRORTEXT(rc)" in line "sigl;SIGNAL error_quit;Quit:;CALL save_msg;tr "[0m"formfeed||crsron;SHUTDOWN;EXIT;Error_Quit:;tr crsron;SHUTDOWN;EXIT